# TopSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Blend..::..TopSketch Property
Blend Class See Also
---
Returns the Top Sketch of the Blend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Sketch TopSketch { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TopSketch As Sketch
	Get
```

Visual C++
---
```text
public:
property Sketch^ TopSketch {
	Sketch^ get ();
}
```

# Remarks
This property is used to retrieve the Top Sketch of the Blend.
# See Also
Blend Class
Autodesk.Revit.DB Namespace